_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузкаДанныхGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатЗагрузкаДанныхGPS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лат</Name>
							<Comment>Широта пункта назначения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лон</Name>
							<Comment>Долгота пункта назначения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Comment>Представление пункта местоположения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скорость</Name>
							<Comment>Текущая скорость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньТоплива</Name>
							<Comment>Уровень топлива в баке</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляФайлаОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатПробегРасходПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатПробегРасходПоМониторингу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРаботыДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОдометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатКоординатыПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатКоординатыПоМониторингу</Name>
			<Comment>История местоположения транспортных средств по данным системы спутникового мониторинга (GPS)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузкаДанныхGPS/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьПолеКодировкаФайла();
	
	ПроизвольныйПериод         = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант = ВариантСтандартногоПериода.Вчера;
	Объект.ДатаНач             = ПроизвольныйПериод.ДатаНачала;
	Объект.ДатаКон             = ПроизвольныйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализацияКомпоновщика();
	
	Если Объект.ПоляФайлаОбмена.Количество() = 0 Тогда
		СброситьНастройкиПолейФайлаОбмена();
	КонецЕсли;
	
	Если Объект.Разделитель = Неопределено Или ПустаяСтрока(СокрЛП(Объект.Разделитель)) Тогда
		Объект.Разделитель = ";";
	КонецЕсли;
	
	Если Объект.Разделитель = Символы.Таб Тогда 
		РазделительТабулятор(Неопределено);
	Иначе 
		РазделительСимвол(Неопределено);
	КонецЕсли;
	
	Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='download unsuccessful';ru='загрузка не выполнена'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ПроизвольныйПериод               = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПроизвольныйПериод.ДатаНачала    = Объект.ДатаНач;
	ПроизвольныйПериод.ДатаОкончания = Объект.ДатаКон;
	
	ДиалогВыбораПериода        = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = ПроизвольныйПериод;
	
	ДиалогВыбораПериода.Показать(Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда
		Элементы.СтраницыЗагрузки.ТекущаяСтраница = Элементы.СтраницыЗагрузки.ПодчиненныеЭлементы.СтраницаОсновное;
		ТекстОшибки = НСтр("en='Not loaded data from a file';ru='Не загружены данные из файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ТаблицаДанных");
		Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='there is no data to load to register';ru='нет данных для загрузки в регистр'");
		Элементы.ИнфНадписьЗагрузкаЗавершена.ЦветТекста = Новый Цвет(255,0,0);
		Возврат;
	КонецЕсли; 
	
	ТекстНСТР = НСтр("en='Execute the information register loading?';ru='Выполнить загрузку регистра сведений?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗагрузкуЗавершение", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФО(Команда)
	
	Если ПустаяСтрока(Объект.Разделитель) И Не Объект.Разделитель = Символы.Таб Тогда
		ТекстОшибки = НСтр("en='Separator not specified';ru='Не указан разделитель'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.Разделитель");
		Возврат;
	КонецЕсли; 
	
	ТекстНСТР = НСтр("en='To load GPS data from file?';ru='Выполнить загрузку данных GPS из файла?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ПрочитатьФОЗавершение", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительСимвол(Команда)
	
	Если Объект.Разделитель = Символы.Таб Или ПустаяСтрока(СокрЛП(Объект.Разделитель))Тогда
		Объект.Разделитель = ";";
	КонецЕсли;
	
	Элементы.РазделительКонтекстноеМенюРазделительТабулятор.Пометка = Ложь;
	Элементы.РазделительКонтекстноеМенюРазделительСимвол.Пометка    = Истина;
	
	Элементы.Разделитель.ТолькоПросмотр = Ложь;
	Элементы.Разделитель.ЦветФона       = Новый Цвет(255,255,255)
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительТабулятор(Команда)
	
	Элементы.РазделительКонтекстноеМенюРазделительТабулятор.Пометка = Истина;
	Элементы.РазделительКонтекстноеМенюРазделительСимвол.Пометка    = Ложь;
	
	Объект.Разделитель = Символы.Таб;
	
	Элементы.Разделитель.ТолькоПросмотр = Истина;
	Элементы.Разделитель.ЦветФона       = Новый Цвет(252,250,235);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьПоля(Команда)
	
	ТекстНСТР = НСтр("en='Set default settings?';ru='Установить настройки по умолчанию?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("СброситьПоляЗавершение", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьПолеКодировкаФайла()
	
	Элементы.КодировкаФайла.СписокВыбора.Добавить("UTF-8",  "UTF-8");
	Элементы.КодировкаФайла.СписокВыбора.Добавить("UTF-16", "UTF-16");
	Элементы.КодировкаФайла.СписокВыбора.Добавить("ANSI",   "ANSI");
	Элементы.КодировкаФайла.СписокВыбора.Добавить("OEM",    "OEM");
	
	КодировкаФайла = "UTF-8";
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиПолейФайлаОбмена()
	
	Объект.ПоляФайлаОбмена.Очистить();
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Date';ru='Дата'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Time';ru='Время'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Vehicle';ru='ТС'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Lat';ru='Лат'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Lon';ru='Лон'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Истина; НоваяСтрока.Поле = НСтр("en='Point';ru='Пункт'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Ложь;   НоваяСтрока.Поле = НСтр("en='Speed';ru='Скорость'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Ложь;   НоваяСтрока.Поле = НСтр("ru = 'Пробег'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Ложь;   НоваяСтрока.Поле = НСтр("ru = 'РасходТоплива'");
	НоваяСтрока = Объект.ПоляФайлаОбмена.Добавить(); НоваяСтрока.Использование = Ложь;   НоваяСтрока.Поле = НСтр(" ru = 'УровеньТоплива'; en = 'Fuel level'");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОтбор(ТекстОшибки)
	
	ОтборКомп = КомпоновщикОтбора.ПолучитьНастройки();
	ПустойОтбор = Новый ПолеКомпоновкиДанных("");
	Для Каждого ТекОтбор Из ОтборКомп.Отбор.Элементы Цикл
		Если ТекОтбор.Использование И ТекОтбор.ЛевоеЗначение = ПустойОтбор Тогда
			ТекстОшибки = НСтр("en='Incorrect set selections!';ru='Некорректно настроены отборы!'");
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных),
       КомпоновщикОтбора.ПолучитьНастройки(), , ,
       Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ =  Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьТаблицуОтбор()

//Считывает одну строку файла обмена и добавляет позицию номенклатуры в дерево
&НаСервере
Процедура ДобавитьСтрокуФайлаВТаблицу(СтрокаОбмена, флОтборТСУстановлен, тблОтборТС)
	
	Если ПустаяСтрока(СтрокаОбмена) Тогда
		Возврат;
	КонецЕсли; 
	
	//Формат строки по умолчанию:
	Формат_строки_по_умолчанию = "Дата Время ТС Лат Лон Скорость Пункт Пробег РасходТоплива УровеньТоплива";
		
	//обрезаем кавычки и добавляем справа доп. разделитель
	ОригинальнаяСтрокаОбмена = СтрокаОбмена;
	СтрокаОбмена = СтрокаОбмена + Объект.Разделитель;//Символы.Таб;
	
	//считаем поля из строки
	списПодстрокиПоля = Новый СписокЗначений; //массив полей, выделенных из строки
	Пока Истина Цикл
		НомРазделителя = Найти(СтрокаОбмена, Объект.Разделитель); //Символы.Таб);
		Если НомРазделителя = 0 Тогда
			Прервать;
		КонецЕсли;
		ПодстрокаПоле = Лев(СтрокаОбмена, НомРазделителя - 1);
		
		списПодстрокиПоля.Добавить(ПодстрокаПоле);
		СтрокаОбмена = Сред(СтрокаОбмена, НомРазделителя + 1);
	КонецЦикла;
	
	Если списПодстрокиПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//промежуточная структура, необходимая для первоначального заполнения строки без помещения в таблицу данных,
	//для возможности отбора, если он установлен
	ТекСтруктураДанных = Новый Структура("Дата, Время, ТС, ПредставлениеТС, Лат, Лон, Пункт, Скорость, Пробег, РасходТоплива, УровеньТоплива");
	
	НомПоля = 1;
	Для Каждого ТекПодстрока Из списПодстрокиПоля Цикл
		НомПоляНастройка = 1;
		Для Каждого ТекСтрокаПолеНастройка Из Объект.ПоляФайлаОбмена Цикл //поиск имени поля в таблице настроек
			Если НомПоляНастройка = НомПоля Тогда
				ТекИмяПоля = ТекСтрокаПолеНастройка.Поле;
				Если ТекИмяПоля = "ТС" Тогда
					ТекСтруктураДанных.ПредставлениеТС = Строка(ТекПодстрока.Значение);
					ТекСтруктураДанных[ТекИмяПоля] = Справочники.ТранспортныеСредства.НайтиПоРеквизиту("уатИДвСистемеНавигации", ТекПодстрока.Значение);
				ИначеЕсли ТекИмяПоля = "Дата" Тогда
					ТекСтруктураДанных[ТекИмяПоля] = Дата(Сред(ТекПодстрока.Значение, 7, 4) + Сред(ТекПодстрока.Значение, 4, 2) + Лев(ТекПодстрока.Значение, 2) + "000000");
				ИначеЕсли ТекИмяПоля = "Время" Тогда
					ТекСтруктураДанных[ТекИмяПоля] = Дата("00010101" + СтрЗаменить(ТекПодстрока.Значение, ":", ""));
				Иначе
					ТекСтруктураДанных[ТекИмяПоля] = Строка(ТекПодстрока.Значение);
				КонецЕсли;
				Прервать;
			КонецЕсли;
			НомПоляНастройка = НомПоляНастройка + 1;
		КонецЦикла;
		
		НомПоля = НомПоля + 1;
	КонецЦикла;
	
	ТекДата = ТекСтруктураДанных.Дата + (ТекСтруктураДанных.Время - '00010101');
	
	Если ((Не флОтборТСУстановлен) Или тблОтборТС.Найти(ТекСтруктураДанных.ПредставлениеТС, "ИДвСистемеНавигации") <> Неопределено)
		И ТекДата >= Объект.ДатаНач И ТекДата <= Объект.ДатаКон Тогда
		НоваяСтрокаДанных = Объект.ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ТекСтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодировкуТекста()
	
	Если КодировкаФайла = "UTF-8" Тогда 
		Возврат КодировкаТекста.UTF8;
	ИначеЕсли КодировкаФайла = "UTF-16" Тогда 
		Возврат КодировкаТекста.UTF16;
	ИначеЕсли КодировкаФайла = "ANSI" Тогда 
		Возврат КодировкаТекста.ANSI;
	ИначеЕсли КодировкаФайла = "OEM" Тогда 
		Возврат КодировкаТекста.OEM;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКодировкуТекста()

&НаСервере
Процедура ЗагрузитьФайлОбмена(ТекстОшибки)
	
	УникальныйИД = Новый УникальныйИдентификатор;
	
	ИмяВременногоФайлаОбмена = КаталогВременныхФайлов() + УникальныйИД + "_data.txt";
	
	ДанныеХранилища = ПолучитьИзВременногоХранилища(ХранилищеФайлаВыгрузки);
	ДанныеХранилища.Записать(ИмяВременногоФайлаОбмена);
	
	//Сначала очистим таблицу номенклатур для загрузки
	Объект.ТаблицаДанных.Очистить();
	
	//Проверим заполнение структуры файла
	ПарамОтбораСтрок = Новый Структура;
	ПарамОтбораСтрок.Вставить("Использование", Истина);
	МассНайденныхСтрок = Объект.ПоляФайлаОбмена.НайтиСтроки(ПарамОтбораСтрок);
	Если МассНайденныхСтрок.Количество() = 0 Тогда
		ТекстОшибки = НСтр("en='No fields are selected in the fields table of the exchange file';ru='Не выбраны поля в таблице полей файла обмена'");
		Возврат;
	КонецЕсли;
	
	//Проверим наличие файла
	ФайлОб = Новый Файл(ИмяВременногоФайлаОбмена);
	Если Не ФайлОб.Существует() Тогда
		ТекстОшибки = НСтр("en='Failed to read Exchange file on server';ru='Неудалось прочитать Файл обмена на сервере'");
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	
	//проверяем установлен ли отбор по ТС, если не установлен то запрос не будем использовать вообще
	флОтборТСУстановлен = Ложь;
	тблОтборТС = Новый ТаблицаЗначений;
	Для Каждого ТекОтбор Из КомпоновщикОтбора.Настройки.Отбор.Элементы Цикл
		Если ТекОтбор.Использование Тогда
			флОтборТСУстановлен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если флОтборТСУстановлен Тогда
		тблОтборТС = ПолучитьТаблицуОтбор(ТекстОшибки);
		тблОтборТС.Индексы.Добавить("ИДвСистемеНавигации");
	КонецЕсли;
	
	//Считаем файл
	ФайлОбменаОбъект = Новый ЧтениеТекста(ИмяВременногоФайлаОбмена, ПолучитьКодировкуТекста());
	
	Попытка
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ИмяВременногоФайлаОбмена);
		ВсегоСтрок = ТекстДок.КоличествоСтрок();
	Исключение
		ВсегоСтрок = "?";
	КонецПопытки;
	НомСтроки = 1;
	
	СтрокаФайлаОбмена = "";
	Пока Не СтрокаФайлаОбмена = Неопределено Цикл
		СтрокаФайлаОбмена = ФайлОбменаОбъект.ПрочитатьСтроку();
		
		Если (СтрокаФайлаОбмена <> Неопределено) И (НЕ ПустаяСтрока(СокрЛП(СтрокаФайлаОбмена))) Тогда
			//Для каждой строки файла обмена сформируем строку
			СтрокаФайлаОбмена = СокрЛП(СтрокаФайлаОбмена);
			Попытка
				ДобавитьСтрокуФайлаВТаблицу(СтрокаФайлаОбмена, флОтборТСУстановлен, тблОтборТС);
			Исключение
				ТекстОшибки = НСтр("en='An error occurred while loading data.';ru='Произошла ошибка при загрузке данных.'");
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		НомСтроки = НомСтроки + 1;
	КонецЦикла;
	
	ФайлОбменаОбъект.Закрыть();
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайлаОбмена);  // Удаляем временный файл обмена
	Исключение КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаРегистраМестонахождениеGPS()
	
	ВсегоСтрок = Объект.ТаблицаДанных.Количество();
	Для Каждого ТекСтрока Из Объект.ТаблицаДанных Цикл
		МенеджерЗаписиМестоположениеGPS = РегистрыСведений.уатПробегРасходПоМониторингу.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиМестоположениеGPS, ТекСтрока);
		МенеджерЗаписиМестоположениеGPS.Период = ТекСтрока.Дата + (ТекСтрока.Время - '00010101');
		
		Попытка
			МенеджерЗаписиМестоположениеGPS.Записать();
		Исключение
			ТекстНСТР = НСтр("en='Cannot write:';ru='Не удалось записать:'") + " " + ТекСтрока.Дата + (ТекСтрока.Время - '00010101') + "; " + ТекСтрока;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из Объект.ТаблицаДанных Цикл
		МенеджерЗаписиКоординатыПоМониторингу = РегистрыСведений.уатКоординатыПоМониторингу.СоздатьМенеджерЗаписи();
		МенеджерЗаписиКоординатыПоМониторингу.Период   = ТекСтрока.Дата + (ТекСтрока.Время - '00010101');
		МенеджерЗаписиКоординатыПоМониторингу.ТС       = ТекСтрока.ТС;
		МенеджерЗаписиКоординатыПоМониторингу.Широта   = ТекСтрока.Лат;
		МенеджерЗаписиКоординатыПоМониторингу.Долгота  = ТекСтрока.Лон;
		МенеджерЗаписиКоординатыПоМониторингу.Скорость = ТекСтрока.Скорость;
		
		Попытка
			МенеджерЗаписиКоординатыПоМониторингу.Записать();
		Исключение
			ТекстНСТР = НСтр("en='Cannot write:';ru='Не удалось записать:'") + " " + ТекСтрока.Дата + (ТекСтрока.Время - '00010101') + "; " + ТекСтрока;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКомпоновщика()
	
	СхемаКомпоновкиДанных = Обработки.уатЗагрузкаДанныхGPS.ПолучитьМакет("НастройкиПостроителя");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	КомпоновщикОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикОтбора.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Если Не Период = Неопределено Тогда
        Объект.ДатаНач = Период.ДатаНачала;
        Объект.ДатаКон = Период.ДатаОкончания;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ТекстНСТР = НСтр("en='Loading data into the information register';ru='Идет загрузка данных в регистр сведений'");
		Состояние(ТекстНСТР);
		ЗагрузкаРегистраМестонахождениеGPS();
		ТекстНСТР = НСтр("en='Loading data into the information register is completed';ru='Загрузка данных в регистр сведений завершена'");
		Состояние(ТекстНСТР);
		Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='data loading completed successfully';ru='загрузка данных завершена успешно'");
		Элементы.ИнфНадписьЗагрузкаЗавершена.ЦветТекста = Новый Цвет(25,85,174);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФОЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ТекстНСТР = НСтр("en='Reading data from the exchange file is in progress. The operation can take a long time';ru='Идет чтение данных из файла обмена. Операция может занять длительное время'");
		ПоказатьОповещениеПользователя(ТекстНСТР);
		
		НачатьПомещениеФайла(
			Новый ОписаниеОповещения("ПрочитатьФОПослеПомещенияВХранилище", ЭтотОбъект),
			ХранилищеФайлаВыгрузки,
			Объект.ФайлОбмена,
			Истина,
			УникальныйИдентификатор);
		
	Иначе 
		Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='data proccesor file is not read';ru='файл обмена не прочитан'");
		Элементы.ИнфНадписьЗагрузкаЗавершена.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФОПослеПомещенияВХранилище(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ФайлОбмена = ВыбранноеИмяФайла;
	
	ОбработкаПрерыванияПользователя();
	
	ХранилищеФайлаВыгрузки = Адрес;
	
	ТекстОшибки = "";
	ЗагрузитьФайлОбмена(ТекстОшибки);
	Если Не ТекстОшибки = "" Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='error reading exchange file';ru='ошибка чтения файла обмена'");
		Элементы.ИнфНадписьЗагрузкаЗавершена.ЦветТекста = Новый Цвет(255,0,0);
	Иначе 
		ТекстНСТР = НСтр("en='Read exchange file is completed';ru='Чтение файла обмена завершено'");
		ПоказатьОповещениеПользователя(ТекстНСТР);
		Элементы.ИнфНадписьЗагрузкаЗавершена.Заголовок = НСтр("en='Exchange file read';ru='файл обмена прочитан'");
		Элементы.ИнфНадписьЗагрузкаЗавершена.ЦветТекста = Новый Цвет(25,85,174);
	КонецЕсли;
	УдалитьИзВременногоХранилища(ХранилищеФайлаВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьПоляЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.ОК Тогда
        СброситьНастройкиПолейФайлаОбмена();
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
